Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	// Документ Заказ покупателя
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
		
	// Документ Поступление товаров и услуг
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
		
	// Документ Реализация товаров и услуг
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицо(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"; 
	
	ПолеВвода.Заголовок = "Контактное лицо";
	

КонецПроцедуры